In [3]:
import pandas as pd
import sqlalchemy
import pprint
import psycopg2
import matplotlib.pyplot as plt
%matplotlib inline

In [4]:
from sqlalchemy import create_engine

In [11]:
# connect to local database
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:passer@localhost:5432/homework1')
connection = engine.connect()

In [12]:
# import departments table
departments = pd.read_sql('select * from departments', connection)

In [13]:
departments

  dept_no           dept_name
0    d001           Marketing
1    d002             Finance
2    d003     Human Resources
3    d004          Production
4    d005         Development
5    d006  Quality Management
6    d007               Sales
7    d008            Research
8    d009    Customer Service

In [14]:
# import the employees table
employees = pd.read_sql('select * from employees', connection, parse_dates=['birth_date', 'hire_date'])
employees.head()

   emp_no emp_title_id birth_date  first_name  last_name sex  hire_date
0  473302        s0001 1953-07-25    Hideyuki   Zallocco   M 1990-04-28
1  475053        e0002 1954-11-18       Byong  Delgrande   F 1991-09-07
2   57444        e0002 1958-01-30       Berry       Babb   F 1992-03-21
3  421786        s0001 1957-09-28       Xiong   Verhoeff   M 1987-11-26
4  282238        e0003 1952-10-28  Abdelkader    Baumann   F 1991-01-18

In [15]:
# Import the Salaries table
salaries = pd.read_sql('select * from salaries', connection, parse_dates=['from_date', 'to_date'])
salaries.head()

   emp_no salary
0   10001  60117
1   10002  65828
2   10003  40006
3   10004  40054
4   10005  78228

In [17]:
# Import the Department Manager table
dept_manager = pd.read_sql('select * from dept_managers', connection, parse_dates=['from_date', 'to_date'])
dept_manager.head()

  dept_no  emp_no
0    d001  110022
1    d001  110039
2    d002  110085
3    d002  110114
4    d003  110183

In [18]:
# Import the Titles table
titles = pd.read_sql('select * from titles', connection, parse_dates=['from_date', 'to_date'])
titles.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [48]:
# Create a merged dataframe of titles and salaries
emp_sal = pd.merge(salaries, on='emp_no', how='right')
emp_sal.head()

TypeError: merge() missing 1 required positional argument: 'right'

In [3]:
# Creating Dataframe with emp_no, title, salary
employee_salaries_df = emp_sal[['emp_no', 'title', 'salary']]
employee_salaries_df.head()

NameError: name 'emp_sal' is not defined

In [2]:
employee_salaries_df.hist(column='salary')

NameError: name 'employee_salaries_df' is not defined